class Messages:
    GREETING = '**Приветствую в нашем магазине мебели!**'
    ABOUT = 'Наша мебельная компания с городстью предлагает качественную и стильную мебель ' \
            'для вашего дома уже более 25 лет. Мы являемся надежным партнером для тех, кто ' \
            'ценит комфорт, функциональность и эстетику в своем интерьере.\n\n' \
            'За все эти годы мы собрали богатый опыт и укрепили свою репутацию благодаря высокому качеству ' \
            'наших изделий и превосходному обслуживанию клиентов. Мы тщательно выбираем материалы и ' \
            'работаем только с талантливыми мастерами, чтобы предложить вам мебель, которая прослужит долгие годы и подарит вам радость и удовлетворение.'
    FAQ = '*1. Каковы сроки доставки?*\n' \
          ' - Обычно сроки доставки составляют от 3 до 7 рабочих дней, в зависимости от вашего местоположения и доступности товара.\n\n' \
          '*2. Могу ли я вернуть или обменять товар?*\n' \
          ' - Да, мы гарантируем политику возврата и обмена. Если вы не полностью удовлетворены приобретенным товаром, вы можете вернуть его в течение 14 дней со дня покупки.\n\n' \
          '*3. Есть ли у вас гарантия на продукцию?*\n' \
          ' - Да, мы предоставляем гарантию на нашу продукцию. Срок гарантии может различаться в зависимости от категории товара.'


class ButtonNames:
    ABOUT = 'ℹ️ О нас'
    FAQ = '❓ FAQ'
    BASKET = '🛒 Корзина'
    CHOOSE_PRODUCT = '🛏 Выбрать мебель'
